# 81. 모름!!!! 확인!!!
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
*valid_score, a, b = scores
print(valid_score)
# "*"을 사용하여 여러개의 값을 저장할 수 있다.
# 값을 특정 변수에 지정하지만 다음에 쓰이지 않고 아무런 의미가 없을 때는 "_"이걸로 지정해준다.
# *valid_score, _, _ = scores

# 82
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
_, _, *valid_score = scores
print(valid_score)

# 83
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
_, *valid_score, _ = scores
print(valid_score)

# 84
temp = {}
print(temp)

# 85
icecream = {"메로나":1000, "폴라포":1200, "빵빠레":1800}
print(icecream)

# 86
icecream["죠스바"] = 1200
icecream["월드콘"] = 1500
print(icecream)

# 87
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}

print("메로나 가격:", ice['메로나'])

# 88
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
ice['메로나'] = 1300
print(ice['메로나'])

# 89
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
del ice['메로나']
print(ice)

# 90
# '누가바' key에 해당하는 값이 없기 때문에 error 발생.
